#### Cleaning data

In [1]:
import pandas as pd

eyes=pd.read_csv('datasets/eye_color.csv',sep=',')
eyes

        Name  Brown  Blue  Black
0      Ester      0     1      0
1  Elizabeth      1     0      0
2   Michelle      0     0      1

In [5]:
# melting columns into single column

eyes = pd.melt(eyes,id_vars='Name')
eyes

# id_vars='Name => means leaving Name column melt every other column into one
# if we need to include more than one than id_vars=['Name','extra']....

        Name variable  value
0      Ester    Brown      0
1  Elizabeth    Brown      1
2   Michelle    Brown      0
3      Ester     Blue      1
4  Elizabeth     Blue      0
5   Michelle     Blue      0
6      Ester    Black      0
7  Elizabeth    Black      0
8   Michelle    Black      1

In [6]:
# renaming variable to eye color

eyes = eyes.rename(columns={'variable':'Eye Color'})
eyes

        Name Eye Color  value
0      Ester     Brown      0
1  Elizabeth     Brown      1
2   Michelle     Brown      0
3      Ester      Blue      1
4  Elizabeth      Blue      0
5   Michelle      Blue      0
6      Ester     Black      0
7  Elizabeth     Black      0
8   Michelle     Black      1

In [7]:
# filtering rows with value == 1

eyes = eyes[eyes.value==1]
eyes

        Name Eye Color  value
1  Elizabeth     Brown      1
3      Ester      Blue      1
8   Michelle     Black      1

In [8]:
# since value column contains 1 only
# we can drop it now

eyes = eyes.drop('value',axis=1)
eyes

        Name Eye Color
1  Elizabeth     Brown
3      Ester      Blue
8   Michelle     Black